#pragma once
#include<time.h>
#include<Windows.h>
#include"Setting.h"
class Menu:public Setting
{
protected:
	char block[7][4][4][4] = {
		//막대모양(회전하는 경우 4가지 포함)
		1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,   1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,   1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,   1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,

		//네모모양(회전하는 경우 4가지 포함)
		2,2,0,0,2,2,0,0,0,0,0,0,0,0,0,0,   2,2,0,0,2,2,0,0,0,0,0,0,0,0,0,0,   2,2,0,0,2,2,0,0,0,0,0,0,0,0,0,0,   2,2,0,0,2,2,0,0,0,0,0,0,0,0,0,0,

		//'ㅓ' 모양(회전하는 경우 4가지 포함)
		0,3,0,0,3,3,0,0,0,3,0,0,0,0,0,0,   3,3,3,0,0,3,0,0,0,0,0,0,0,0,0,0,   3,0,0,0,3,3,0,0,3,0,0,0,0,0,0,0,   0,3,0,0,3,3,3,0,0,0,0,0,0,0,0,0,

		//'ㄱ'모양(회전하는 경우 4가지 포함)
		4,4,0,0,0,4,0,0,0,4,0,0,0,0,0,0,   4,4,4,0,4,0,0,0,0,0,0,0,0,0,0,0,   4,0,0,0,4,0,0,0,4,4,0,0,0,0,0,0,   0,0,4,0,4,4,4,0,0,0,0,0,0,0,0,0,

		//'ㄴ' 모양(회전하는 경우 4가지 포함)
		5,5,0,0,5,0,0,0,5,0,0,0,0,0,0,0,   5,0,0,0,5,5,5,0,0,0,0,0,0,0,0,0,   0,5,0,0,0,5,0,0,5,5,0,0,0,0,0,0,   5,5,5,0,0,0,5,0,0,0,0,0,0,0,0,0,

		//'Z' 모양(회전하는 경우 4가지 포함)
		6,6,0,0,0,6,6,0,0,0,0,0,0,0,0,0,   0,6,0,0,6,6,0,0,6,0,0,0,0,0,0,0,   6,6,0,0,0,6,6,0,0,0,0,0,0,0,0,0,   0,6,0,0,6,6,0,0,6,0,0,0,0,0,0,0,

		//'S' 모양(회전하는 경우 4가지 포함)
		0,7,7,0,7,7,0,0,0,0,0,0,0,0,0,0,   7,0,0,0,7,7,0,0,0,7,0,0,0,0,0,0,   0,7,7,0,7,7,0,0,0,0,0,0,0,0,0,0,   7,0,0,0,7,7,0,0,0,7,0,0,0,0,0,0

	};
	struct STAGE {      //각 스테이지마다의 난이도 설정
		int   speed;   //숫자가 낮을수록 속도가 빠르다
		int stick_rate;      //막대가 나오는 확률 0~99 , 99면 막대기만 나옴
		int clear_line;   //깨야하는 막대 수
	};
	struct STAGE stage_data[10]; //구조체 스테이지에 난이도 저장(0~9)
	int level = 0;
	int ab_x, ab_y;   //화면중 블럭이 나타나는 좌표의 절대위치
	int lines; //라인
	char total_block[21][14];
	int money;
	int limit;
public:
	Menu();
	~Menu();
	int show_logo();
	int input_data();
	int init();
	int show_cur_block(int shape, int angle, int x, int y);
	int erase_cur_block(int shape, int angle, int x, int y);   //블럭 진행의 잔상을 지우기 위한 함수
};

